<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Re-packages BusyCal in a new PKG without nasty scripts.</string>
	<key>Identifier</key>
	<string>com.github.maffio31.pkg.BusyCal</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>ParentRecipe</key>
	<string>com.github.maffio31.download.BusyCal</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
